espressif/esp-idf/components/soc/esp32c2/register/soc/efuse_reg.h
/** EFUSE_RD_BLK1_DATA0_REG register
 *  BLOCK1 data register 0.
 */
#define EFUSE_RD_BLK1_DATA0_REG (DR_REG_EFUSE_BASE + 0x34)
/** EFUSE_CUSTOM_MAC : R; bitpos: [31:0]; default: 0;
 *  Custom MAC address
 */
#define EFUSE_CUSTOM_MAC    0xFFFFFFFFU
#define EFUSE_CUSTOM_MAC_M  (EFUSE_CUSTOM_MAC_V << EFUSE_CUSTOM_MAC_S)
#define EFUSE_CUSTOM_MAC_V  0xFFFFFFFFU
#define EFUSE_CUSTOM_MAC_S  0

/** EFUSE_RD_BLK1_DATA1_REG register
 *  BLOCK1 data register 1.
 */
#define EFUSE_RD_BLK1_DATA1_REG (DR_REG_EFUSE_BASE + 0x38)
/** EFUSE_CUSTOM_MAC_1 : R; bitpos: [15:0]; default: 0;
 *  Custom MAC address
 */
#define EFUSE_CUSTOM_MAC_1    0x0000FFFFU
#define EFUSE_CUSTOM_MAC_1_M  (EFUSE_CUSTOM_MAC_1_V << EFUSE_CUSTOM_MAC_1_S)
#define EFUSE_CUSTOM_MAC_1_V  0x0000FFFFU
#define EFUSE_CUSTOM_MAC_1_S  0
/** EFUSE_RESERVED_1_48 : R; bitpos: [31:16]; default: 0;
 *  reserved
 */
#define EFUSE_RESERVED_1_48    0x0000FFFFU
#define EFUSE_RESERVED_1_48_M  (EFUSE_RESERVED_1_48_V << EFUSE_RESERVED_1_48_S)
#define EFUSE_RESERVED_1_48_V  0x0000FFFFU
#define EFUSE_RESERVED_1_48_S  16

/** EFUSE_RD_BLK1_DATA2_REG register
 *  BLOCK1 data register 2.
 */
#define EFUSE_RD_BLK1_DATA2_REG (DR_REG_EFUSE_BASE + 0x3c)
/** EFUSE_SYSTEM_DATA2 : RO; bitpos: [23:0]; default: 0;
 *  Stores the bits [64:87] of system data.
 */
#define EFUSE_SYSTEM_DATA2    0x00FFFFFFU
#define EFUSE_SYSTEM_DATA2_M  (EFUSE_SYSTEM_DATA2_V << EFUSE_SYSTEM_DATA2_S)
#define EFUSE_SYSTEM_DATA2_V  0x00FFFFFFU
#define EFUSE_SYSTEM_DATA2_S  0

/** EFUSE_RD_BLK2_DATA0_REG register
 *  Register 0 of BLOCK2.
 */
#define EFUSE_RD_BLK2_DATA0_REG (DR_REG_EFUSE_BASE + 0x40)
/** EFUSE_MAC : R; bitpos: [31:0]; default: 0;
 *  MAC address
 */
#define EFUSE_MAC    0xFFFFFFFFU
#define EFUSE_MAC_M  (EFUSE_MAC_V << EFUSE_MAC_S)
#define EFUSE_MAC_V  0xFFFFFFFFU
#define EFUSE_MAC_S  0

/** EFUSE_RD_BLK2_DATA1_REG register
 *  Register 1 of BLOCK2.
 */
#define EFUSE_RD_BLK2_DATA1_REG (DR_REG_EFUSE_BASE + 0x44)
/** EFUSE_MAC_1 : R; bitpos: [15:0]; default: 0;
 *  MAC address
 */
#define EFUSE_MAC_1    0x0000FFFFU
#define EFUSE_MAC_1_M  (EFUSE_MAC_1_V << EFUSE_MAC_1_S)
#define EFUSE_MAC_1_V  0x0000FFFFU
#define EFUSE_MAC_1_S  0
/** EFUSE_WAFER_VERSION_MINOR : R; bitpos: [19:16]; default: 0;
 *  WAFER_VERSION_MINOR
 */
#define EFUSE_WAFER_VERSION_MINOR    0x0000000FU
#define EFUSE_WAFER_VERSION_MINOR_M  (EFUSE_WAFER_VERSION_MINOR_V << EFUSE_WAFER_VERSION_MINOR_S)
#define EFUSE_WAFER_VERSION_MINOR_V  0x0000000FU
#define EFUSE_WAFER_VERSION_MINOR_S  16
/** EFUSE_WAFER_VERSION_MAJOR : R; bitpos: [21:20]; default: 0;
 *  WAFER_VERSION_MAJOR
 */
#define EFUSE_WAFER_VERSION_MAJOR    0x00000003U
#define EFUSE_WAFER_VERSION_MAJOR_M  (EFUSE_WAFER_VERSION_MAJOR_V << EFUSE_WAFER_VERSION_MAJOR_S)
#define EFUSE_WAFER_VERSION_MAJOR_V  0x00000003U
#define EFUSE_WAFER_VERSION_MAJOR_S  20
/** EFUSE_PKG_VERSION : R; bitpos: [24:22]; default: 0;
 *  EFUSE_PKG_VERSION
 */
#define EFUSE_PKG_VERSION    0x00000007U
#define EFUSE_PKG_VERSION_M  (EFUSE_PKG_VERSION_V << EFUSE_PKG_VERSION_S)
#define EFUSE_PKG_VERSION_V  0x00000007U
#define EFUSE_PKG_VERSION_S  22
/** EFUSE_BLK_VERSION_MINOR : R; bitpos: [27:25]; default: 0;
 *  Minor version of BLOCK2
 */
#define EFUSE_BLK_VERSION_MINOR    0x00000007U
#define EFUSE_BLK_VERSION_MINOR_M  (EFUSE_BLK_VERSION_MINOR_V << EFUSE_BLK_VERSION_MINOR_S)
#define EFUSE_BLK_VERSION_MINOR_V  0x00000007U
#define EFUSE_BLK_VERSION_MINOR_S  25
/** EFUSE_BLK_VERSION_MAJOR : R; bitpos: [29:28]; default: 0;
 *  Major version of BLOCK2
 */
#define EFUSE_BLK_VERSION_MAJOR    0x00000003U
#define EFUSE_BLK_VERSION_MAJOR_M  (EFUSE_BLK_VERSION_MAJOR_V << EFUSE_BLK_VERSION_MAJOR_S)
#define EFUSE_BLK_VERSION_MAJOR_V  0x00000003U
#define EFUSE_BLK_VERSION_MAJOR_S  28
/** EFUSE_OCODE : R; bitpos: [31:30]; default: 0;
 *  OCode
 */
#define EFUSE_OCODE    0x00000003U
#define EFUSE_OCODE_M  (EFUSE_OCODE_V << EFUSE_OCODE_S)
#define EFUSE_OCODE_V  0x00000003U
#define EFUSE_OCODE_S  30

/** EFUSE_RD_BLK2_DATA2_REG register
 *  Register 2 of BLOCK2.
 */
#define EFUSE_RD_BLK2_DATA2_REG (DR_REG_EFUSE_BASE + 0x48)
/** EFUSE_OCODE_1 : R; bitpos: [4:0]; default: 0;
 *  OCode
 */
#define EFUSE_OCODE_1    0x0000001FU
#define EFUSE_OCODE_1_M  (EFUSE_OCODE_1_V << EFUSE_OCODE_1_S)
#define EFUSE_OCODE_1_V  0x0000001FU
#define EFUSE_OCODE_1_S  0
/** EFUSE_TEMP_CALIB : R; bitpos: [13:5]; default: 0;
 *  Temperature calibration data
 */
#define EFUSE_TEMP_CALIB    0x000001FFU
#define EFUSE_TEMP_CALIB_M  (EFUSE_TEMP_CALIB_V << EFUSE_TEMP_CALIB_S)
#define EFUSE_TEMP_CALIB_V  0x000001FFU
#define EFUSE_TEMP_CALIB_S  5
/** EFUSE_ADC1_INIT_CODE_ATTEN0 : R; bitpos: [21:14]; default: 0;
 *  ADC1 init code at atten0
 */
#define EFUSE_ADC1_INIT_CODE_ATTEN0    0x000000FFU
#define EFUSE_ADC1_INIT_CODE_ATTEN0_M  (EFUSE_ADC1_INIT_CODE_ATTEN0_V << EFUSE_ADC1_INIT_CODE_ATTEN0_S)
#define EFUSE_ADC1_INIT_CODE_ATTEN0_V  0x000000FFU
#define EFUSE_ADC1_INIT_CODE_ATTEN0_S  14
/** EFUSE_ADC1_INIT_CODE_ATTEN3 : R; bitpos: [26:22]; default: 0;
 *  ADC1 init code at atten3
 */
#define EFUSE_ADC1_INIT_CODE_ATTEN3    0x0000001FU
#define EFUSE_ADC1_INIT_CODE_ATTEN3_M  (EFUSE_ADC1_INIT_CODE_ATTEN3_V << EFUSE_ADC1_INIT_CODE_ATTEN3_S)
#define EFUSE_ADC1_INIT_CODE_ATTEN3_V  0x0000001FU
#define EFUSE_ADC1_INIT_CODE_ATTEN3_S  22
/** EFUSE_ADC1_CAL_VOL_ATTEN0 : R; bitpos: [31:27]; default: 0;
 *  ADC1 calibration voltage at atten0
 */
#define EFUSE_ADC1_CAL_VOL_ATTEN0    0x0000001FU
#define EFUSE_ADC1_CAL_VOL_ATTEN0_M  (EFUSE_ADC1_CAL_VOL_ATTEN0_V << EFUSE_ADC1_CAL_VOL_ATTEN0_S)
#define EFUSE_ADC1_CAL_VOL_ATTEN0_V  0x0000001FU
#define EFUSE_ADC1_CAL_VOL_ATTEN0_S  27

/** EFUSE_RD_BLK2_DATA3_REG register
 *  Register 3 of BLOCK2.
 */
#define EFUSE_RD_BLK2_DATA3_REG (DR_REG_EFUSE_BASE + 0x4c)
/** EFUSE_ADC1_CAL_VOL_ATTEN0_1 : R; bitpos: [2:0]; default: 0;
 *  ADC1 calibration voltage at atten0
 */
#define EFUSE_ADC1_CAL_VOL_ATTEN0_1    0x00000007U
#define EFUSE_ADC1_CAL_VOL_ATTEN0_1_M  (EFUSE_ADC1_CAL_VOL_ATTEN0_1_V << EFUSE_ADC1_CAL_VOL_ATTEN0_1_S)
#define EFUSE_ADC1_CAL_VOL_ATTEN0_1_V  0x00000007U
#define EFUSE_ADC1_CAL_VOL_ATTEN0_1_S  0
/** EFUSE_ADC1_CAL_VOL_ATTEN3 : R; bitpos: [8:3]; default: 0;
 *  ADC1 calibration voltage at atten3
 */
#define EFUSE_ADC1_CAL_VOL_ATTEN3    0x0000003FU
#define EFUSE_ADC1_CAL_VOL_ATTEN3_M  (EFUSE_ADC1_CAL_VOL_ATTEN3_V << EFUSE_ADC1_CAL_VOL_ATTEN3_S)
#define EFUSE_ADC1_CAL_VOL_ATTEN3_V  0x0000003FU
#define EFUSE_ADC1_CAL_VOL_ATTEN3_S  3
/** EFUSE_DIG_DBIAS_HVT : R; bitpos: [13:9]; default: 0;
 *  BLOCK2 digital dbias when hvt
 */
#define EFUSE_DIG_DBIAS_HVT    0x0000001FU
#define EFUSE_DIG_DBIAS_HVT_M  (EFUSE_DIG_DBIAS_HVT_V << EFUSE_DIG_DBIAS_HVT_S)
#define EFUSE_DIG_DBIAS_HVT_V  0x0000001FU
#define EFUSE_DIG_DBIAS_HVT_S  9
/** EFUSE_DIG_LDO_SLP_DBIAS2 : R; bitpos: [20:14]; default: 0;
 *  BLOCK2 DIG_LDO_DBG0_DBIAS2
 */
#define EFUSE_DIG_LDO_SLP_DBIAS2    0x0000007FU
#define EFUSE_DIG_LDO_SLP_DBIAS2_M  (EFUSE_DIG_LDO_SLP_DBIAS2_V << EFUSE_DIG_LDO_SLP_DBIAS2_S)
#define EFUSE_DIG_LDO_SLP_DBIAS2_V  0x0000007FU
#define EFUSE_DIG_LDO_SLP_DBIAS2_S  14
/** EFUSE_DIG_LDO_SLP_DBIAS26 : R; bitpos: [28:21]; default: 0;
 *  BLOCK2 DIG_LDO_DBG0_DBIAS26
 */
#define EFUSE_DIG_LDO_SLP_DBIAS26    0x000000FFU
#define EFUSE_DIG_LDO_SLP_DBIAS26_M  (EFUSE_DIG_LDO_SLP_DBIAS26_V << EFUSE_DIG_LDO_SLP_DBIAS26_S)
#define EFUSE_DIG_LDO_SLP_DBIAS26_V  0x000000FFU
#define EFUSE_DIG_LDO_SLP_DBIAS26_S  21
/** EFUSE_DIG_LDO_ACT_DBIAS26 : R; bitpos: [31:29]; default: 0;
 *  BLOCK2 DIG_LDO_ACT_DBIAS26
 */
#define EFUSE_DIG_LDO_ACT_DBIAS26    0x00000007U
#define EFUSE_DIG_LDO_ACT_DBIAS26_M  (EFUSE_DIG_LDO_ACT_DBIAS26_V << EFUSE_DIG_LDO_ACT_DBIAS26_S)
#define EFUSE_DIG_LDO_ACT_DBIAS26_V  0x00000007U
#define EFUSE_DIG_LDO_ACT_DBIAS26_S  29

/** EFUSE_RD_BLK2_DATA4_REG register
 *  Register 4 of BLOCK2.
 */
#define EFUSE_RD_BLK2_DATA4_REG (DR_REG_EFUSE_BASE + 0x50)
/** EFUSE_DIG_LDO_ACT_DBIAS26_1 : R; bitpos: [2:0]; default: 0;
 *  BLOCK2 DIG_LDO_ACT_DBIAS26
 */
#define EFUSE_DIG_LDO_ACT_DBIAS26_1    0x00000007U
#define EFUSE_DIG_LDO_ACT_DBIAS26_1_M  (EFUSE_DIG_LDO_ACT_DBIAS26_1_V << EFUSE_DIG_LDO_ACT_DBIAS26_1_S)
#define EFUSE_DIG_LDO_ACT_DBIAS26_1_V  0x00000007U
#define EFUSE_DIG_LDO_ACT_DBIAS26_1_S  0
/** EFUSE_DIG_LDO_ACT_STEPD10 : R; bitpos: [6:3]; default: 0;
 *  BLOCK2 DIG_LDO_ACT_STEPD10
 */
#define EFUSE_DIG_LDO_ACT_STEPD10    0x0000000FU
#define EFUSE_DIG_LDO_ACT_STEPD10_M  (EFUSE_DIG_LDO_ACT_STEPD10_V << EFUSE_DIG_LDO_ACT_STEPD10_S)
#define EFUSE_DIG_LDO_ACT_STEPD10_V  0x0000000FU
#define EFUSE_DIG_LDO_ACT_STEPD10_S  3
/** EFUSE_RTC_LDO_SLP_DBIAS13 : R; bitpos: [13:7]; default: 0;
 *  BLOCK2 DIG_LDO_SLP_DBIAS13
 */
#define EFUSE_RTC_LDO_SLP_DBIAS13    0x0000007FU
#define EFUSE_RTC_LDO_SLP_DBIAS13_M  (EFUSE_RTC_LDO_SLP_DBIAS13_V << EFUSE_RTC_LDO_SLP_DBIAS13_S)
#define EFUSE_RTC_LDO_SLP_DBIAS13_V  0x0000007FU
#define EFUSE_RTC_LDO_SLP_DBIAS13_S  7
/** EFUSE_RTC_LDO_SLP_DBIAS29 : R; bitpos: [22:14]; default: 0;
 *  BLOCK2 DIG_LDO_SLP_DBIAS29
 */
#define EFUSE_RTC_LDO_SLP_DBIAS29    0x000001FFU
#define EFUSE_RTC_LDO_SLP_DBIAS29_M  (EFUSE_RTC_LDO_SLP_DBIAS29_V << EFUSE_RTC_LDO_SLP_DBIAS29_S)
#define EFUSE_RTC_LDO_SLP_DBIAS29_V  0x000001FFU
#define EFUSE_RTC_LDO_SLP_DBIAS29_S  14
/** EFUSE_RTC_LDO_SLP_DBIAS31 : R; bitpos: [28:23]; default: 0;
 *  BLOCK2 DIG_LDO_SLP_DBIAS31
 */
#define EFUSE_RTC_LDO_SLP_DBIAS31    0x0000003FU
#define EFUSE_RTC_LDO_SLP_DBIAS31_M  (EFUSE_RTC_LDO_SLP_DBIAS31_V << EFUSE_RTC_LDO_SLP_DBIAS31_S)
#define EFUSE_RTC_LDO_SLP_DBIAS31_V  0x0000003FU
#define EFUSE_RTC_LDO_SLP_DBIAS31_S  23
/** EFUSE_RTC_LDO_ACT_DBIAS31 : R; bitpos: [31:29]; default: 0;
 *  BLOCK2 DIG_LDO_ACT_DBIAS31
 */
#define EFUSE_RTC_LDO_ACT_DBIAS31    0x00000007U
#define EFUSE_RTC_LDO_ACT_DBIAS31_M  (EFUSE_RTC_LDO_ACT_DBIAS31_V << EFUSE_RTC_LDO_ACT_DBIAS31_S)
#define EFUSE_RTC_LDO_ACT_DBIAS31_V  0x00000007U
#define EFUSE_RTC_LDO_ACT_DBIAS31_S  29

/** EFUSE_RD_BLK2_DATA5_REG register
 *  Register 5 of BLOCK2.
 */
#define EFUSE_RD_BLK2_DATA5_REG (DR_REG_EFUSE_BASE + 0x54)
/** EFUSE_RTC_LDO_ACT_DBIAS31_1 : R; bitpos: [2:0]; default: 0;
 *  BLOCK2 DIG_LDO_ACT_DBIAS31
 */
#define EFUSE_RTC_LDO_ACT_DBIAS31_1    0x00000007U
#define EFUSE_RTC_LDO_ACT_DBIAS31_1_M  (EFUSE_RTC_LDO_ACT_DBIAS31_1_V << EFUSE_RTC_LDO_ACT_DBIAS31_1_S)
#define EFUSE_RTC_LDO_ACT_DBIAS31_1_V  0x00000007U
#define EFUSE_RTC_LDO_ACT_DBIAS31_1_S  0
/** EFUSE_RTC_LDO_ACT_DBIAS13 : R; bitpos: [10:3]; default: 0;
 *  BLOCK2 DIG_LDO_ACT_DBIAS13
 */
#define EFUSE_RTC_LDO_ACT_DBIAS13    0x000000FFU
#define EFUSE_RTC_LDO_ACT_DBIAS13_M  (EFUSE_RTC_LDO_ACT_DBIAS13_V << EFUSE_RTC_LDO_ACT_DBIAS13_S)
#define EFUSE_RTC_LDO_ACT_DBIAS13_V  0x000000FFU
#define EFUSE_RTC_LDO_ACT_DBIAS13_S  3
/** EFUSE_RESERVED_2_171 : R; bitpos: [31:11]; default: 0;
 *  reserved
 */
#define EFUSE_RESERVED_2_171    0x001FFFFFU
#define EFUSE_RESERVED_2_171_M  (EFUSE_RESERVED_2_171_V << EFUSE_RESERVED_2_171_S)
#define EFUSE_RESERVED_2_171_V  0x001FFFFFU
#define EFUSE_RESERVED_2_171_S  11

