espressif/esp-idf/components/soc/esp32c2/register/soc/efuse_reg.h
/** EFUSE_RD_BLK2_DATA6_REG register
 *  Register 6 of BLOCK2.
 */
#define EFUSE_RD_BLK2_DATA6_REG (DR_REG_EFUSE_BASE + 0x58)
/** EFUSE_ADC_CALIBRATION_3 : RO; bitpos: [10:0]; default: 0;
 *  Store the bit [86:96] of ADC calibration data.
 */
#define EFUSE_ADC_CALIBRATION_3    0x000007FFU
#define EFUSE_ADC_CALIBRATION_3_M  (EFUSE_ADC_CALIBRATION_3_V << EFUSE_ADC_CALIBRATION_3_S)
#define EFUSE_ADC_CALIBRATION_3_V  0x000007FFU
#define EFUSE_ADC_CALIBRATION_3_S  0
/** EFUSE_BLK2_RESERVED_DATA_0 : RO; bitpos: [31:11]; default: 0;
 *  Store the bit [0:20] of block2 reserved data.
 */
#define EFUSE_BLK2_RESERVED_DATA_0    0x001FFFFFU
#define EFUSE_BLK2_RESERVED_DATA_0_M  (EFUSE_BLK2_RESERVED_DATA_0_V << EFUSE_BLK2_RESERVED_DATA_0_S)
#define EFUSE_BLK2_RESERVED_DATA_0_V  0x001FFFFFU
#define EFUSE_BLK2_RESERVED_DATA_0_S  11

/** EFUSE_RD_BLK2_DATA7_REG register
 *  Register 7 of BLOCK2.
 */
#define EFUSE_RD_BLK2_DATA7_REG (DR_REG_EFUSE_BASE + 0x5c)
/** EFUSE_RESERVED_2_224 : R; bitpos: [23:0]; default: 0;
 *  reserved
 */
#define EFUSE_RESERVED_2_224    0x00FFFFFFU
#define EFUSE_RESERVED_2_224_M  (EFUSE_RESERVED_2_224_V << EFUSE_RESERVED_2_224_S)
#define EFUSE_RESERVED_2_224_V  0x00FFFFFFU
#define EFUSE_RESERVED_2_224_S  0
/** EFUSE_FLASH_VENDOR : R; bitpos: [26:24]; default: 0;
 *  Flash vendor
 */
#define EFUSE_FLASH_VENDOR    0x00000007U
#define EFUSE_FLASH_VENDOR_M  (EFUSE_FLASH_VENDOR_V << EFUSE_FLASH_VENDOR_S)
#define EFUSE_FLASH_VENDOR_V  0x00000007U
#define EFUSE_FLASH_VENDOR_S  24
/** EFUSE_FLASH_TEMP : R; bitpos: [28:27]; default: 0;
 *  Flash temperature rating
 */
#define EFUSE_FLASH_TEMP    0x00000003U
#define EFUSE_FLASH_TEMP_M  (EFUSE_FLASH_TEMP_V << EFUSE_FLASH_TEMP_S)
#define EFUSE_FLASH_TEMP_V  0x00000003U
#define EFUSE_FLASH_TEMP_S  27
/** EFUSE_FLASH_CAP : R; bitpos: [31:29]; default: 0;
 *  Flash capacity
 */
#define EFUSE_FLASH_CAP    0x00000007U
#define EFUSE_FLASH_CAP_M  (EFUSE_FLASH_CAP_V << EFUSE_FLASH_CAP_S)
#define EFUSE_FLASH_CAP_V  0x00000007U
#define EFUSE_FLASH_CAP_S  29

/** EFUSE_RD_BLK3_DATA0_REG register
 *  Register 0 of BLOCK3.
 */
#define EFUSE_RD_BLK3_DATA0_REG (DR_REG_EFUSE_BASE + 0x60)
/** EFUSE_BLK3_DATA0 : RO; bitpos: [31:0]; default: 0;
 *  Store the first 32-bit of Block3.
 */
#define EFUSE_BLK3_DATA0    0xFFFFFFFFU
#define EFUSE_BLK3_DATA0_M  (EFUSE_BLK3_DATA0_V << EFUSE_BLK3_DATA0_S)
#define EFUSE_BLK3_DATA0_V  0xFFFFFFFFU
#define EFUSE_BLK3_DATA0_S  0

/** EFUSE_RD_BLK3_DATA1_REG register
 *  Register 1 of BLOCK3.
 */
#define EFUSE_RD_BLK3_DATA1_REG (DR_REG_EFUSE_BASE + 0x64)
/** EFUSE_BLK3_DATA1 : RO; bitpos: [31:0]; default: 0;
 *  Store the second 32-bit of Block3.
 */
#define EFUSE_BLK3_DATA1    0xFFFFFFFFU
#define EFUSE_BLK3_DATA1_M  (EFUSE_BLK3_DATA1_V << EFUSE_BLK3_DATA1_S)
#define EFUSE_BLK3_DATA1_V  0xFFFFFFFFU
#define EFUSE_BLK3_DATA1_S  0

/** EFUSE_RD_BLK3_DATA2_REG register
 *  Register 2 of BLOCK3.
 */
#define EFUSE_RD_BLK3_DATA2_REG (DR_REG_EFUSE_BASE + 0x68)
/** EFUSE_BLK3_DATA2 : RO; bitpos: [31:0]; default: 0;
 *  Store the third 32-bit of Block3.
 */
#define EFUSE_BLK3_DATA2    0xFFFFFFFFU
#define EFUSE_BLK3_DATA2_M  (EFUSE_BLK3_DATA2_V << EFUSE_BLK3_DATA2_S)
#define EFUSE_BLK3_DATA2_V  0xFFFFFFFFU
#define EFUSE_BLK3_DATA2_S  0

/** EFUSE_RD_BLK3_DATA3_REG register
 *  Register 3 of BLOCK3.
 */
#define EFUSE_RD_BLK3_DATA3_REG (DR_REG_EFUSE_BASE + 0x6c)
/** EFUSE_BLK3_DATA3 : RO; bitpos: [31:0]; default: 0;
 *  Store the fourth 32-bit of Block3.
 */
#define EFUSE_BLK3_DATA3    0xFFFFFFFFU
#define EFUSE_BLK3_DATA3_M  (EFUSE_BLK3_DATA3_V << EFUSE_BLK3_DATA3_S)
#define EFUSE_BLK3_DATA3_V  0xFFFFFFFFU
#define EFUSE_BLK3_DATA3_S  0

/** EFUSE_RD_BLK3_DATA4_REG register
 *  Register 4 of BLOCK3.
 */
#define EFUSE_RD_BLK3_DATA4_REG (DR_REG_EFUSE_BASE + 0x70)
/** EFUSE_BLK3_DATA4 : RO; bitpos: [31:0]; default: 0;
 *  Store the fifth 32-bit of Block3.
 */
#define EFUSE_BLK3_DATA4    0xFFFFFFFFU
#define EFUSE_BLK3_DATA4_M  (EFUSE_BLK3_DATA4_V << EFUSE_BLK3_DATA4_S)
#define EFUSE_BLK3_DATA4_V  0xFFFFFFFFU
#define EFUSE_BLK3_DATA4_S  0

/** EFUSE_RD_BLK3_DATA5_REG register
 *  Register 5 of BLOCK3.
 */
#define EFUSE_RD_BLK3_DATA5_REG (DR_REG_EFUSE_BASE + 0x74)
/** EFUSE_BLK3_DATA5 : RO; bitpos: [31:0]; default: 0;
 *  Store the sixth 32-bit of Block3.
 */
#define EFUSE_BLK3_DATA5    0xFFFFFFFFU
#define EFUSE_BLK3_DATA5_M  (EFUSE_BLK3_DATA5_V << EFUSE_BLK3_DATA5_S)
#define EFUSE_BLK3_DATA5_V  0xFFFFFFFFU
#define EFUSE_BLK3_DATA5_S  0

/** EFUSE_RD_BLK3_DATA6_REG register
 *  Register 6 of BLOCK3.
 */
#define EFUSE_RD_BLK3_DATA6_REG (DR_REG_EFUSE_BASE + 0x78)
/** EFUSE_BLK3_DATA6 : RO; bitpos: [31:0]; default: 0;
 *  Store the seventh 32-bit of Block3.
 */
#define EFUSE_BLK3_DATA6    0xFFFFFFFFU
#define EFUSE_BLK3_DATA6_M  (EFUSE_BLK3_DATA6_V << EFUSE_BLK3_DATA6_S)
#define EFUSE_BLK3_DATA6_V  0xFFFFFFFFU
#define EFUSE_BLK3_DATA6_S  0

/** EFUSE_RD_BLK3_DATA7_REG register
 *  Register 7 of BLOCK3.
 */
#define EFUSE_RD_BLK3_DATA7_REG (DR_REG_EFUSE_BASE + 0x7c)
/** EFUSE_BLK3_DATA7 : RO; bitpos: [31:0]; default: 0;
 *  Store the eighth 32-bit of Block3.
 */
#define EFUSE_BLK3_DATA7    0xFFFFFFFFU
#define EFUSE_BLK3_DATA7_M  (EFUSE_BLK3_DATA7_V << EFUSE_BLK3_DATA7_S)
#define EFUSE_BLK3_DATA7_V  0xFFFFFFFFU
#define EFUSE_BLK3_DATA7_S  0

/** EFUSE_RD_REPEAT_ERR_REG register
 *  Programming error record register 0 of BLOCK0.
 */
#define EFUSE_RD_REPEAT_ERR_REG (DR_REG_EFUSE_BASE + 0x80)
/** EFUSE_RD_DIS_ERR : RO; bitpos: [1:0]; default: 0;
 *  If any bit in RD_DIS is 1, then it indicates a programming error.
 */
#define EFUSE_RD_DIS_ERR    0x00000003U
#define EFUSE_RD_DIS_ERR_M  (EFUSE_RD_DIS_ERR_V << EFUSE_RD_DIS_ERR_S)
#define EFUSE_RD_DIS_ERR_V  0x00000003U
#define EFUSE_RD_DIS_ERR_S  0
/** EFUSE_WDT_DELAY_SEL_ERR : RO; bitpos: [3:2]; default: 0;
 *  If any bit in WDT_DELAY_SEL is 1, then it indicates a programming error.
 */
#define EFUSE_WDT_DELAY_SEL_ERR    0x00000003U
#define EFUSE_WDT_DELAY_SEL_ERR_M  (EFUSE_WDT_DELAY_SEL_ERR_V << EFUSE_WDT_DELAY_SEL_ERR_S)
#define EFUSE_WDT_DELAY_SEL_ERR_V  0x00000003U
#define EFUSE_WDT_DELAY_SEL_ERR_S  2
/** EFUSE_DIS_PAD_JTAG_ERR : RO; bitpos: [4]; default: 0;
 *  If any bit in DIS_PAD_JTAG is 1, then it indicates a programming error.
 */
#define EFUSE_DIS_PAD_JTAG_ERR    (BIT(4))
#define EFUSE_DIS_PAD_JTAG_ERR_M  (EFUSE_DIS_PAD_JTAG_ERR_V << EFUSE_DIS_PAD_JTAG_ERR_S)
#define EFUSE_DIS_PAD_JTAG_ERR_V  0x00000001U
#define EFUSE_DIS_PAD_JTAG_ERR_S  4
/** EFUSE_DIS_DOWNLOAD_ICACHE_ERR : RO; bitpos: [5]; default: 0;
 *  If any bit in this filed is 1, then it indicates a programming error.
 */
#define EFUSE_DIS_DOWNLOAD_ICACHE_ERR    (BIT(5))
#define EFUSE_DIS_DOWNLOAD_ICACHE_ERR_M  (EFUSE_DIS_DOWNLOAD_ICACHE_ERR_V << EFUSE_DIS_DOWNLOAD_ICACHE_ERR_S)
#define EFUSE_DIS_DOWNLOAD_ICACHE_ERR_V  0x00000001U
#define EFUSE_DIS_DOWNLOAD_ICACHE_ERR_S  5
/** EFUSE_DIS_DOWNLOAD_MANUAL_ENCRYPT_ERR : RO; bitpos: [6]; default: 0;
 *  If any bit in DIS_DOWNLOAD_MANUAL_ENCRYPT is 1, then it indicates a programming
 *  error.
 */
#define EFUSE_DIS_DOWNLOAD_MANUAL_ENCRYPT_ERR    (BIT(6))
#define EFUSE_DIS_DOWNLOAD_MANUAL_ENCRYPT_ERR_M  (EFUSE_DIS_DOWNLOAD_MANUAL_ENCRYPT_ERR_V << EFUSE_DIS_DOWNLOAD_MANUAL_ENCRYPT_ERR_S)
#define EFUSE_DIS_DOWNLOAD_MANUAL_ENCRYPT_ERR_V  0x00000001U
#define EFUSE_DIS_DOWNLOAD_MANUAL_ENCRYPT_ERR_S  6
/** EFUSE_SPI_BOOT_ENCRYPT_DECRYPT_CNT_ERR : RO; bitpos: [9:7]; default: 0;
 *  If any bit in SPI_BOOT_ENCRYPT_DECRYPT_CNT is 1, then it indicates a programming
 *  error.
 */
#define EFUSE_SPI_BOOT_ENCRYPT_DECRYPT_CNT_ERR    0x00000007U
#define EFUSE_SPI_BOOT_ENCRYPT_DECRYPT_CNT_ERR_M  (EFUSE_SPI_BOOT_ENCRYPT_DECRYPT_CNT_ERR_V << EFUSE_SPI_BOOT_ENCRYPT_DECRYPT_CNT_ERR_S)
#define EFUSE_SPI_BOOT_ENCRYPT_DECRYPT_CNT_ERR_V  0x00000007U
#define EFUSE_SPI_BOOT_ENCRYPT_DECRYPT_CNT_ERR_S  7
/** EFUSE_XTS_KEY_LENGTH_256_ERR : RO; bitpos: [10]; default: 0;
 *  If any bit in XTS_KEY_LENGTH_256 is 1, then it indicates a programming error.
 */
#define EFUSE_XTS_KEY_LENGTH_256_ERR    (BIT(10))
#define EFUSE_XTS_KEY_LENGTH_256_ERR_M  (EFUSE_XTS_KEY_LENGTH_256_ERR_V << EFUSE_XTS_KEY_LENGTH_256_ERR_S)
#define EFUSE_XTS_KEY_LENGTH_256_ERR_V  0x00000001U
#define EFUSE_XTS_KEY_LENGTH_256_ERR_S  10
/** EFUSE_UART_PRINT_CONTROL_ERR : RO; bitpos: [12:11]; default: 0;
 *  If any bit in UART_PRINT_CONTROL is 1, then it indicates a programming error.
 */
#define EFUSE_UART_PRINT_CONTROL_ERR    0x00000003U
#define EFUSE_UART_PRINT_CONTROL_ERR_M  (EFUSE_UART_PRINT_CONTROL_ERR_V << EFUSE_UART_PRINT_CONTROL_ERR_S)
#define EFUSE_UART_PRINT_CONTROL_ERR_V  0x00000003U
#define EFUSE_UART_PRINT_CONTROL_ERR_S  11
/** EFUSE_FORCE_SEND_RESUME_ERR : RO; bitpos: [13]; default: 0;
 *  If any bit in FORCE_SEND_RESUME is 1, then it indicates a programming error.
 */
#define EFUSE_FORCE_SEND_RESUME_ERR    (BIT(13))
#define EFUSE_FORCE_SEND_RESUME_ERR_M  (EFUSE_FORCE_SEND_RESUME_ERR_V << EFUSE_FORCE_SEND_RESUME_ERR_S)
#define EFUSE_FORCE_SEND_RESUME_ERR_V  0x00000001U
#define EFUSE_FORCE_SEND_RESUME_ERR_S  13
/** EFUSE_DIS_DOWNLOAD_MODE_ERR : RO; bitpos: [14]; default: 0;
 *  If any bit in this filed is 1, then it indicates a programming error.
 */
#define EFUSE_DIS_DOWNLOAD_MODE_ERR    (BIT(14))
#define EFUSE_DIS_DOWNLOAD_MODE_ERR_M  (EFUSE_DIS_DOWNLOAD_MODE_ERR_V << EFUSE_DIS_DOWNLOAD_MODE_ERR_S)
#define EFUSE_DIS_DOWNLOAD_MODE_ERR_V  0x00000001U
#define EFUSE_DIS_DOWNLOAD_MODE_ERR_S  14
/** EFUSE_DIS_DIRECT_BOOT_ERR : RO; bitpos: [15]; default: 0;
 *  If any bit in this filed is 1, then it indicates a programming error.
 */
#define EFUSE_DIS_DIRECT_BOOT_ERR    (BIT(15))
#define EFUSE_DIS_DIRECT_BOOT_ERR_M  (EFUSE_DIS_DIRECT_BOOT_ERR_V << EFUSE_DIS_DIRECT_BOOT_ERR_S)
#define EFUSE_DIS_DIRECT_BOOT_ERR_V  0x00000001U
#define EFUSE_DIS_DIRECT_BOOT_ERR_S  15
/** EFUSE_ENABLE_SECURITY_DOWNLOAD_ERR : RO; bitpos: [16]; default: 0;
 *  If any bit in this filed is 1, then it indicates a programming error.
 */
#define EFUSE_ENABLE_SECURITY_DOWNLOAD_ERR    (BIT(16))
#define EFUSE_ENABLE_SECURITY_DOWNLOAD_ERR_M  (EFUSE_ENABLE_SECURITY_DOWNLOAD_ERR_V << EFUSE_ENABLE_SECURITY_DOWNLOAD_ERR_S)
#define EFUSE_ENABLE_SECURITY_DOWNLOAD_ERR_V  0x00000001U
#define EFUSE_ENABLE_SECURITY_DOWNLOAD_ERR_S  16
/** EFUSE_FLASH_TPUW_ERR : RO; bitpos: [20:17]; default: 0;
 *  If any bit in this filed is 1, then it indicates a programming error.
 */
#define EFUSE_FLASH_TPUW_ERR    0x0000000FU
#define EFUSE_FLASH_TPUW_ERR_M  (EFUSE_FLASH_TPUW_ERR_V << EFUSE_FLASH_TPUW_ERR_S)
#define EFUSE_FLASH_TPUW_ERR_V  0x0000000FU
#define EFUSE_FLASH_TPUW_ERR_S  17
/** EFUSE_SECURE_BOOT_EN_ERR : RO; bitpos: [21]; default: 0;
 *  If any bit in this filed is 1, then it indicates a programming error.
 */
#define EFUSE_SECURE_BOOT_EN_ERR    (BIT(21))
#define EFUSE_SECURE_BOOT_EN_ERR_M  (EFUSE_SECURE_BOOT_EN_ERR_V << EFUSE_SECURE_BOOT_EN_ERR_S)
#define EFUSE_SECURE_BOOT_EN_ERR_V  0x00000001U
#define EFUSE_SECURE_BOOT_EN_ERR_S  21
/** EFUSE_RPT4_RESERVED_ERR : RO; bitpos: [31:22]; default: 0;
 *  Reserved.
 */
#define EFUSE_RPT4_RESERVED_ERR    0x000003FFU
#define EFUSE_RPT4_RESERVED_ERR_M  (EFUSE_RPT4_RESERVED_ERR_V << EFUSE_RPT4_RESERVED_ERR_S)
#define EFUSE_RPT4_RESERVED_ERR_V  0x000003FFU
#define EFUSE_RPT4_RESERVED_ERR_S  22

/** EFUSE_RD_RS_ERR_REG register
 *  Programming error record register 0 of BLOCK1-10.
 */
#define EFUSE_RD_RS_ERR_REG (DR_REG_EFUSE_BASE + 0x84)
/** EFUSE_BLK1_ERR_NUM : RO; bitpos: [2:0]; default: 0;
 *  The value of this signal means the number of error bytes in block1.
 */
#define EFUSE_BLK1_ERR_NUM    0x00000007U
#define EFUSE_BLK1_ERR_NUM_M  (EFUSE_BLK1_ERR_NUM_V << EFUSE_BLK1_ERR_NUM_S)
#define EFUSE_BLK1_ERR_NUM_V  0x00000007U
#define EFUSE_BLK1_ERR_NUM_S  0
/** EFUSE_BLK1_FAIL : RO; bitpos: [3]; default: 0;
 *  0: Means no failure and that the data of block1 is reliable 1: Means that
 *  programming user data failed and the number of error bytes is over 6.
 */
#define EFUSE_BLK1_FAIL    (BIT(3))
#define EFUSE_BLK1_FAIL_M  (EFUSE_BLK1_FAIL_V << EFUSE_BLK1_FAIL_S)
#define EFUSE_BLK1_FAIL_V  0x00000001U
#define EFUSE_BLK1_FAIL_S  3
/** EFUSE_BLK2_ERR_NUM : RO; bitpos: [6:4]; default: 0;
 *  The value of this signal means the number of error bytes in block2.
 */
#define EFUSE_BLK2_ERR_NUM    0x00000007U
#define EFUSE_BLK2_ERR_NUM_M  (EFUSE_BLK2_ERR_NUM_V << EFUSE_BLK2_ERR_NUM_S)
#define EFUSE_BLK2_ERR_NUM_V  0x00000007U
#define EFUSE_BLK2_ERR_NUM_S  4
/** EFUSE_BLK2_FAIL : RO; bitpos: [7]; default: 0;
 *  0: Means no failure and that the data of block2 is reliable 1: Means that
 *  programming user data failed and the number of error bytes is over 6.
 */
#define EFUSE_BLK2_FAIL    (BIT(7))
#define EFUSE_BLK2_FAIL_M  (EFUSE_BLK2_FAIL_V << EFUSE_BLK2_FAIL_S)
#define EFUSE_BLK2_FAIL_V  0x00000001U
#define EFUSE_BLK2_FAIL_S  7
/** EFUSE_BLK3_ERR_NUM : RO; bitpos: [10:8]; default: 0;
 *  The value of this signal means the number of error bytes in block3.
 */
#define EFUSE_BLK3_ERR_NUM    0x00000007U
#define EFUSE_BLK3_ERR_NUM_M  (EFUSE_BLK3_ERR_NUM_V << EFUSE_BLK3_ERR_NUM_S)
#define EFUSE_BLK3_ERR_NUM_V  0x00000007U
#define EFUSE_BLK3_ERR_NUM_S  8
/** EFUSE_BLK3_FAIL : RO; bitpos: [11]; default: 0;
 *  0: Means no failure and that the block3 data is reliable 1: Means that programming
 *  user data failed and the number of error bytes is over 6.
 */
#define EFUSE_BLK3_FAIL    (BIT(11))
#define EFUSE_BLK3_FAIL_M  (EFUSE_BLK3_FAIL_V << EFUSE_BLK3_FAIL_S)
#define EFUSE_BLK3_FAIL_V  0x00000001U
#define EFUSE_BLK3_FAIL_S  11

